#!/usr/bin/env bash

cat "$1" | cut -f1 | sort -n -r -t . -k 1,1 -k 2,2 -k 3,3 -k 4,4 

#Сразу продолжается список адресов первый байт которых равен 1. 
cat "$1" | cut -f1 | sort -n -r -t . -k 1,1 -k 2,2 -k 3,3 -k 4,4 | awk '{split($0 , oct , "."); if (oct[1] == '1') print $0;}'

#Сразу продолжается список адресов первый байт которых равен 46, а второй 70.    
cat "$1" | cut -f1 | sort -n -r -t . -k 1,1 -k 2,2 -k 3,3 -k 4,4 | awk '{split($0 , oct , "."); if (oct[1] == '46' && oct[2] == '70') print $0;}'

#Сразу продолжается список адресов любой байт которых равен 46.
cat "$1" | cut -f1 | sort -n -r -t . -k 1,1 -k 2,2 -k 3,3 -k 4,4 | awk '{split($0 , oct , "."); if (oct[1] == '46' || oct[2] == '46' || oct[3] == '46' || oct[4] == '46') print $0;}'

